app/views/issues/show.html.erb

SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]
---
          <ul class="post-related-list small-12 medium-8 columns alpha">
            <% Issue.find(params[:id]).articles.each do |article| %>