app/views/home/index.html.erb

SELECT "issues".* FROM "issues"   ORDER BY created_at desc
---
            <div class="issue-intro small-10 columns" ng-cloak>
              <h2 class="issue-intro-title"><%= @issues.first.title %></h2>