app/controllers/articles_controller.rb

  def show
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.create(article_params)
---
INSERT INTO "articles" ("article_feature", "created_at", "introduction", "language", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "article_feature" = ?, "updated_at" = ? WHERE "articles"."id" = 3  [["article_feature", "TSAO-China-02-FCJZ_A_Lake-01.png"], ["updated_at", "2015-01-23 20:51:21.393866"]]