app/controllers/home_controller.rb

  def index
    @articles = Article.order('created_at desc')
    @issues = Issue.order('created_at desc')
---
SELECT "articles".* FROM "articles"   ORDER BY created_at desc
SELECT "issues".* FROM "issues"   ORDER BY created_at desc