app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    @issues = Issue.all

SELECT  "issues".* FROM "issues"  WHERE "issues"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_issue
      @issue = Issue.find(1)